{
  "items": [
    {
      "id": 1,
      "url": "device",
      "tags": ["Page making"],
      "image": {
        "thumb": ["static/img/works/prev/device.png", "static/img/works/big/device.png"]
      },
      "title": "DEVICE - online gadget store",
      "description": ["The educational project of the basic intensity for imposition from Html Academy.", "The project was compiled according to the model, which I chose on an intensive basis. The project was tested according to the criteria for the technical side of the code. Also, the compliance of the layout and layout to pixel perfect was checked. The project was the most difficult on an intensive basis, according to the authors. I defended it 100%."],
      "link": ["https://morecodemore.github.io/device/index.html", "https://morecodemore.github.io/device/catalog.html"],
      "linkHeading": ["Main page: ", "Catalog page: "]
    },
    {
      "id": 2,
      "url": "bikees",
      "tags": ["Page making"],
      "image": {
        "thumb": ["static/img/works/prev/bikees.png", "static/img/works/big/bikees.png"]
      },
      "title": "Bikees - online bicycle shop",
      "description": ["Educational project adaptive layout of the main page of the online bike shop.", "I implemented this project as a training for the practice of flexible layout of blocks on Flexbox and adaptive layout."],
      "link": ["https://morecodemore.github.io/bikees/"],
      "linkHeading": ["Main page: "  ]
    },
    {
      "id": 3,
      "url": "jewelry_catalog_landing",
        "tags": ["Design","Page making","Interactive"],
      "image": {
        "thumb": ["static/img/works/prev/catalog.png", "static/img/works/big/catalog_landing.png"]
      },
      "title": "Information lending of Jewelry catalog",
      "description": ["Information lending of one of the products Studio 256 - Jewelry catalog.", "Landing reveals the essence of the product. Easy texts are supplemented with graphics and animation, demonstrating the capabilities and benefits of the developed service. I prepared the graphics, and then packed it into a nice and fresh design. Then he made an adaptive layout and revived the JS."],
      "link": ["https://morecodemore.github.io/jewelry-catalog/"],
      "linkHeading": ["Project website: "]
    },
    {
      "id": 4,
      "url": "patskan",
      "tags": ["Design","Page making","Frontend"],
      "image": {
        "thumb": ["static/img/works/prev/patskan.png", "static/img/works/big/patsckan.png"]
      },
      "title": "Patskan - artist's portfolio",
      "description": ["Full cycle of portfolio development for the artist.", "This work is a small one-page web application with page routing and transition animation. The customer defined the concept of the project. Based on the wishes of the customer, I projecting the design of the site. Next, I created it and wrote the frontend to the project logic on Vue.js. The site is in test mode."],
      "link": ["https://morecodemore.github.io/patskan/"],
      "linkHeading": ["Project website: "]
    },
    {
      "id": 5,
      "url": "med_studio",
      "tags": ["Projecting"],
      "image": {
        "thumb": ["static/img/works/prev/med.png", "static/img/works/big/sto.png"]
      },
      "title": "med.studio - medical online education",
      "description": ["Designing prototypes for the service of medical online education - med.studio.", "med.studio is the site of the company that organizes large online and offline events. Objective: to develop a resource structure for posting conference materials, scheduling upcoming events and conducting webinars. I worked on the first iteration of the service. The project site is in test mode."],
      "link": ["https://med.studio/"],
      "linkHeading": ["Project website: "]
    },
    {
      "id": 6,
      "url": "openmedcom",
      "tags": ["Projecting"],
      "image": {
        "thumb": ["static/img/works/prev/landing.png", "static/img/works/big/catalog.png"]
      },
      "title": "Jewelery catalog without worries",
      "description": ["Designing prototypes for a jewelery catalog template.", "The project has a goal - to help jewelers in demonstrating their work to clients. I composed the essential and functional maps of the project, as well as prototypes of 2 versions of the catalog: a portfolio of works and a version with a store for bulk buyers."],
      "link": ["https://demo.mycatalog.pro/user/sign-in/login?demo=1"],
      "linkHeading": ["Project website: "]
    },
    {
      "id": 7,
      "url": "openmedcom",
      "tags": ["Projecting", "Design"],
      "image": {
        "thumb": ["static/img/works/prev/openmedcom_promo.png", "static/img/works/big/openmedcom.png"]
      },
      "title": "New Year's promotional page for the service openmedcom.ru",
      "description": ["Designing prototypes and the template of the promotional page.", "As a gift from the developer's studio, we prepared a summary of the results for 2017 for the client. On the basis of statistical data, I marked up an interactive map by region, indicating the number of users in each of them. Further, proceeding from the existing design, I assembled a design page layout. The client was pleasantly surprised."],
      "link": ["https://openmedcom.ru/pages/promo", "https://codepen.io/ulyanov2022/pen/eybKxL"],
      "linkHeading": ["Making page: ", "Interactive map: "]
    },
    {
      "id": 8,
      "url": "mst",
      "tags": ["Page making", "Interactive"],
      "image": {
        "thumb": ["static/img/works/prev/mst.png", "static/img/works/big/mst.png"]
      },
      "title": "The site of the company «Bridge building technologies»",
      "description": ["Page making according to the customer's design.", "MST is a large distributor of products for construction, in particular bridges and reinforced concrete structures. Feature of the project: the block of the multilevel menu which conveniently adapts for smart phones and tablets. The site looks great in all modern browsers, including IE11."],
      "link": ["https://morecodemore.github.io/mst.online/"],
      "linkHeading": ["Making page: "]
    },
    {
      "id": 9,
      "url": "stroymost",
      "tags": ["Page making","Interactive"],
      "image": {
        "thumb": ["static/img/works/prev/stroymost.png", "static/img/works/big/stroymost.png"]
      },
      "title": "The site of the company IC «Stroymost»",
      "description": ["Page making according to the customer's design.", "IC «Stroymost» is another distributor of products for construction. The layout of the project was implemented using a template and a component approach to development. Naming of classes and the project structure corresponds to the BEM methodology. The site looks great in all modern browsers, including IE11."],
      "link": ["https://morecodemore.github.io/stroymost.online/"],
      "linkHeading": ["Сверстанный проект: "]
    }
  ]
}
